### **Aplicaciones de conceptos estadísticos en conjunto de datos** ###

Mstemáticas y Estadística para Inteligencia Artificial

**Instructora**: Helen Clara Peñate Rodríguez

**Alumno**: Aminadab Córdova Acosta

Ejercicios. Desarrolle los siguientes planteamientos. Aunque est´an pensados
a desarrollarse en Python, usted podr´a elegir cualquier otro lenguaje o entorno
de programaci´on. Si usted opta por esta segunda opci´on, aseg´urese de utilizar
el mismo conjunto de datos (eg. iris, tips. etc). Usted deber´a incluir el c´odigo
fuente usado y la salida generada. Adem´as debe incluir sus observaciones de lo
que fue obteniendo. Al final deber´a entregar un archivo en formato PDF.

**1. Operaciones básicas**

Instrucciones:
1. Crea un array de 10 elementos con valores entre 1 y 10.
2. Calcula la media, mediana, y desviaci´on est´andar de los valores.
3. Multiplica cada valor por 2.

In [ ]:
import numpy as np

#1. Crear un array de 10 elementos con valores aleatorios entre 1 y 10
arr = np.arange(1, 11, 1)
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [10]:
#2. Calcula la media, mediana y desviación estándar del array
mean = np.mean(arr)
median = np.median(arr)
std_dev = np.std(arr)
print("Media: ", mean, "Mediana: ", median, "Desviacion Estándar: ", std_dev)

Media:  5.5 Mediana:  5.5 Desviacion Estándar:  2.8722813232690143

In [12]:
# 3. Multiplicar el array por 2
arr_mult = arr * 2
print("Array multiplicado por 2: ", arr_mult)

Array multiplicado por 2:  [ 2  4  6  8 10 12 14 16 18 20]

**2. Operaciones con Dataframes**

Instrucciones:
1. Crea un DataFrame con 3 columnas (A, B, C) y 5 filas con números
aleatorios enteros.
2. Renombra las columnas a Col1, Col2, Col3.
3. A˜nade una nueva columna que sea la suma de las columnas Col1 y Col2.
4. Elimina todas las filas donde el valor de Col3 sea menor que 10

In [13]:
# 1. Crea un Dataframe con 3 columnas y 5 filas con valores aleatorios enterios
import pandas as pd

# Generar un DataFrame 
df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A', 'B', 'C'])
df

    A   B   C
0  51   5  79
1  95  69  10
2   8  10  56
3  15  25   8
4  36  10  63

In [14]:
# 2. Renombra las columnas a 'Col1', 'Col2', 'Col3'
df.rename(columns={'A': 'Col1', 'B': 'Col2', 'C': 'Col3'}, inplace=True)
df

   Col1  Col2  Col3
0    51     5    79
1    95    69    10
2     8    10    56
3    15    25     8
4    36    10    63

In [15]:
# 3. Añade una nueva columna 'Col4' que sea la suma de 'Col1' y 'Col2'
df['Col4'] = df['Col1'] + df['Col2']
df

   Col1  Col2  Col3  Col4
0    51     5    79    56
1    95    69    10   164
2     8    10    56    18
3    15    25     8    40
4    36    10    63    46

In [16]:
# 4. Elimina todas las filas donde 'Col3' sea menor que 10
df = df[df['Col3'] >= 10]
df

   Col1  Col2  Col3  Col4
0    51     5    79    56
1    95    69    10   164
2     8    10    56    18
4    36    10    63    46